Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_NETC_ENETC.h
#define NETC_ENETC_PSIMAFCAPR_NUM_MAC_AFTE_MASK  (0xFFFU)
#define NETC_ENETC_PSIMAFCAPR_NUM_MAC_AFTE_SHIFT (0U)
#define NETC_ENETC_PSIMAFCAPR_NUM_MAC_AFTE(x)    (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSIMAFCAPR_NUM_MAC_AFTE_SHIFT)) & NETC_ENETC_PSIMAFCAPR_NUM_MAC_AFTE_MASK)
/*! @} */

/*! @name PUFDMFR - Port unicast frames dropped due to MAC filtering register */
/*! @{ */

#define NETC_ENETC_PUFDMFR_FRAME_DROP_MASK       (0xFFFFFFFFU)
#define NETC_ENETC_PUFDMFR_FRAME_DROP_SHIFT      (0U)
#define NETC_ENETC_PUFDMFR_FRAME_DROP(x)         (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PUFDMFR_FRAME_DROP_SHIFT)) & NETC_ENETC_PUFDMFR_FRAME_DROP_MASK)
/*! @} */

/*! @name PMFDMFR - Port multicast frames dropped due to MAC filtering register */
/*! @{ */

#define NETC_ENETC_PMFDMFR_FRAME_DROP_MASK       (0xFFFFFFFFU)
#define NETC_ENETC_PMFDMFR_FRAME_DROP_SHIFT      (0U)
#define NETC_ENETC_PMFDMFR_FRAME_DROP(x)         (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PMFDMFR_FRAME_DROP_SHIFT)) & NETC_ENETC_PMFDMFR_FRAME_DROP_MASK)
/*! @} */

/*! @name PSIVLANFCAPR - Port station interface VLAN filtering capability register */
/*! @{ */

#define NETC_ENETC_PSIVLANFCAPR_NUM_VLAN_FTE_MASK (0xFFFU)
#define NETC_ENETC_PSIVLANFCAPR_NUM_VLAN_FTE_SHIFT (0U)
#define NETC_ENETC_PSIVLANFCAPR_NUM_VLAN_FTE(x)  (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSIVLANFCAPR_NUM_VLAN_FTE_SHIFT)) & NETC_ENETC_PSIVLANFCAPR_NUM_VLAN_FTE_MASK)
/*! @} */

/*! @name PSIVLANFMR - Port station interface VLAN filtering mode register */
/*! @{ */

#define NETC_ENETC_PSIVLANFMR_VS_MASK            (0x1U)
#define NETC_ENETC_PSIVLANFMR_VS_SHIFT           (0U)
/*! VS
 *  0b0..Inner VLAN tag will be used for VLAN filtering
 *  0b1..Outer VLAN tag will be used for VLAN filtering
 */
#define NETC_ENETC_PSIVLANFMR_VS(x)              (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSIVLANFMR_VS_SHIFT)) & NETC_ENETC_PSIVLANFMR_VS_MASK)
/*! @} */

/*! @name PUFDVFR - Port unicast frames dropped VLAN filtering register */
/*! @{ */

#define NETC_ENETC_PUFDVFR_FRAME_DROP_MASK       (0xFFFFFFFFU)
#define NETC_ENETC_PUFDVFR_FRAME_DROP_SHIFT      (0U)
#define NETC_ENETC_PUFDVFR_FRAME_DROP(x)         (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PUFDVFR_FRAME_DROP_SHIFT)) & NETC_ENETC_PUFDVFR_FRAME_DROP_MASK)
/*! @} */

/*! @name PMFDVFR - Port multicast frames dropped VLAN filtering register */
/*! @{ */

#define NETC_ENETC_PMFDVFR_FRAME_DROP_MASK       (0xFFFFFFFFU)
#define NETC_ENETC_PMFDVFR_FRAME_DROP_SHIFT      (0U)
#define NETC_ENETC_PMFDVFR_FRAME_DROP(x)         (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PMFDVFR_FRAME_DROP_SHIFT)) & NETC_ENETC_PMFDVFR_FRAME_DROP_MASK)
/*! @} */

/*! @name PBFDVFR - Port broadcast frames dropped VLAN filtering register */
/*! @{ */

#define NETC_ENETC_PBFDVFR_FRAME_DROP_MASK       (0xFFFFFFFFU)
#define NETC_ENETC_PBFDVFR_FRAME_DROP_SHIFT      (0U)
#define NETC_ENETC_PBFDVFR_FRAME_DROP(x)         (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PBFDVFR_FRAME_DROP_SHIFT)) & NETC_ENETC_PBFDVFR_FRAME_DROP_MASK)
/*! @} */

/*! @name PLPMR - Port low power mode register */
/*! @{ */

#define NETC_ENETC_PLPMR_WME_MASK                (0x1U)
#define NETC_ENETC_PLPMR_WME_SHIFT               (0U)
/*! WME
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define NETC_ENETC_PLPMR_WME(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PLPMR_WME_SHIFT)) & NETC_ENETC_PLPMR_WME_MASK)
/*! @} */

/*! @name PWOSR - Port wake-on status register */
/*! @{ */

#define NETC_ENETC_PWOSR_WOLA_MASK               (0x1U)
#define NETC_ENETC_PWOSR_WOLA_SHIFT              (0U)
/*! WOLA
 *  0b0..Inactive
 *  0b1..Active. ENETC is actively searching for frames matching the Wake-on-LAN event criteria.
 */
#define NETC_ENETC_PWOSR_WOLA(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PWOSR_WOLA_SHIFT)) & NETC_ENETC_PWOSR_WOLA_MASK)

#define NETC_ENETC_PWOSR_ICMB_MASK               (0x2U)
#define NETC_ENETC_PWOSR_ICMB_SHIFT              (1U)
/*! ICMB
 *  0b0..Not blocked
 *  0b1..Blocked.
 */
#define NETC_ENETC_PWOSR_ICMB(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PWOSR_ICMB_SHIFT)) & NETC_ENETC_PWOSR_ICMB_MASK)
/*! @} */

/*! @name IPV2ICMPMR0 - Receive IPV to ICM priority mapping register 0 */
/*! @{ */

#define NETC_ENETC_IPV2ICMPMR0_IPV0ICM_MASK      (0x1U)
#define NETC_ENETC_IPV2ICMPMR0_IPV0ICM_SHIFT     (0U)
#define NETC_ENETC_IPV2ICMPMR0_IPV0ICM(x)        (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_IPV2ICMPMR0_IPV0ICM_SHIFT)) & NETC_ENETC_IPV2ICMPMR0_IPV0ICM_MASK)

#define NETC_ENETC_IPV2ICMPMR0_IPV1ICM_MASK      (0x10U)
#define NETC_ENETC_IPV2ICMPMR0_IPV1ICM_SHIFT     (4U)
#define NETC_ENETC_IPV2ICMPMR0_IPV1ICM(x)        (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_IPV2ICMPMR0_IPV1ICM_SHIFT)) & NETC_ENETC_IPV2ICMPMR0_IPV1ICM_MASK)

#define NETC_ENETC_IPV2ICMPMR0_IPV2ICM_MASK      (0x100U)
#define NETC_ENETC_IPV2ICMPMR0_IPV2ICM_SHIFT     (8U)
#define NETC_ENETC_IPV2ICMPMR0_IPV2ICM(x)        (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_IPV2ICMPMR0_IPV2ICM_SHIFT)) & NETC_ENETC_IPV2ICMPMR0_IPV2ICM_MASK)

#define NETC_ENETC_IPV2ICMPMR0_IPV3ICM_MASK      (0x1000U)
#define NETC_ENETC_IPV2ICMPMR0_IPV3ICM_SHIFT     (12U)
#define NETC_ENETC_IPV2ICMPMR0_IPV3ICM(x)        (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_IPV2ICMPMR0_IPV3ICM_SHIFT)) & NETC_ENETC_IPV2ICMPMR0_IPV3ICM_MASK)

#define NETC_ENETC_IPV2ICMPMR0_IPV4ICM_MASK      (0x10000U)
#define NETC_ENETC_IPV2ICMPMR0_IPV4ICM_SHIFT     (16U)
#define NETC_ENETC_IPV2ICMPMR0_IPV4ICM(x)        (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_IPV2ICMPMR0_IPV4ICM_SHIFT)) & NETC_ENETC_IPV2ICMPMR0_IPV4ICM_MASK)

#define NETC_ENETC_IPV2ICMPMR0_IPV5ICM_MASK      (0x100000U)
#define NETC_ENETC_IPV2ICMPMR0_IPV5ICM_SHIFT     (20U)
#define NETC_ENETC_IPV2ICMPMR0_IPV5ICM(x)        (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_IPV2ICMPMR0_IPV5ICM_SHIFT)) & NETC_ENETC_IPV2ICMPMR0_IPV5ICM_MASK)

#define NETC_ENETC_IPV2ICMPMR0_IPV6ICM_MASK      (0x1000000U)
#define NETC_ENETC_IPV2ICMPMR0_IPV6ICM_SHIFT     (24U)
#define NETC_ENETC_IPV2ICMPMR0_IPV6ICM(x)        (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_IPV2ICMPMR0_IPV6ICM_SHIFT)) & NETC_ENETC_IPV2ICMPMR0_IPV6ICM_MASK)

#define NETC_ENETC_IPV2ICMPMR0_IPV7ICM_MASK      (0x10000000U)
#define NETC_ENETC_IPV2ICMPMR0_IPV7ICM_SHIFT     (28U)
#define NETC_ENETC_IPV2ICMPMR0_IPV7ICM(x)        (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_IPV2ICMPMR0_IPV7ICM_SHIFT)) & NETC_ENETC_IPV2ICMPMR0_IPV7ICM_MASK)
/*! @} */

