Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_NETC_ENETC.h
/*! @name PSIVLANFCFGR - Port station interface 0 VLAN filtering configuration register..Port station interface 1 VLAN filtering configuration register */
/*! @{ */

#define NETC_ENETC_PSIVLANFCFGR_NUM_VLAN_FTE_MASK (0xFFU)
#define NETC_ENETC_PSIVLANFCFGR_NUM_VLAN_FTE_SHIFT (0U)
#define NETC_ENETC_PSIVLANFCFGR_NUM_VLAN_FTE(x)  (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSIVLANFCFGR_NUM_VLAN_FTE_SHIFT)) & NETC_ENETC_PSIVLANFCFGR_NUM_VLAN_FTE_MASK)
/*! @} */

/* The count of NETC_ENETC_PSIVLANFCFGR */
#define NETC_ENETC_PSIVLANFCFGR_COUNT            (2U)

/*! @name PSIUMHFR0 - Port station interface 0 unicast MAC hash filter register 0..Port station interface 1 unicast MAC hash filter register 0 */
/*! @{ */

#define NETC_ENETC_PSIUMHFR0_MAC_HASH_FLT_LOW_MASK (0xFFFFFFFFU)
#define NETC_ENETC_PSIUMHFR0_MAC_HASH_FLT_LOW_SHIFT (0U)
#define NETC_ENETC_PSIUMHFR0_MAC_HASH_FLT_LOW(x) (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSIUMHFR0_MAC_HASH_FLT_LOW_SHIFT)) & NETC_ENETC_PSIUMHFR0_MAC_HASH_FLT_LOW_MASK)
/*! @} */

/* The count of NETC_ENETC_PSIUMHFR0 */
#define NETC_ENETC_PSIUMHFR0_COUNT               (2U)

/*! @name PSIUMHFR1 - Port station interface 0 unicast MAC hash filter register 1..Port station interface 1 unicast MAC hash filter register 1 */
/*! @{ */

#define NETC_ENETC_PSIUMHFR1_MAC_HASH_FLT_HIGH_MASK (0xFFFFFFFFU)
#define NETC_ENETC_PSIUMHFR1_MAC_HASH_FLT_HIGH_SHIFT (0U)
#define NETC_ENETC_PSIUMHFR1_MAC_HASH_FLT_HIGH(x) (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSIUMHFR1_MAC_HASH_FLT_HIGH_SHIFT)) & NETC_ENETC_PSIUMHFR1_MAC_HASH_FLT_HIGH_MASK)
/*! @} */

/* The count of NETC_ENETC_PSIUMHFR1 */
#define NETC_ENETC_PSIUMHFR1_COUNT               (2U)

/*! @name PSIMMHFR0 - Port station interface 0 multicast MAC hash filter register 0..Port station interface 1 multicast MAC hash filter register 0 */
/*! @{ */

#define NETC_ENETC_PSIMMHFR0_MAC_HASH_FLT_LOW_MASK (0xFFFFFFFFU)
#define NETC_ENETC_PSIMMHFR0_MAC_HASH_FLT_LOW_SHIFT (0U)
#define NETC_ENETC_PSIMMHFR0_MAC_HASH_FLT_LOW(x) (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSIMMHFR0_MAC_HASH_FLT_LOW_SHIFT)) & NETC_ENETC_PSIMMHFR0_MAC_HASH_FLT_LOW_MASK)
/*! @} */

/* The count of NETC_ENETC_PSIMMHFR0 */
#define NETC_ENETC_PSIMMHFR0_COUNT               (2U)

/*! @name PSIMMHFR1 - Port station interface 0 multicast MAC hash filter register 1..Port station interface 1 multicast MAC hash filter register 1 */
/*! @{ */

#define NETC_ENETC_PSIMMHFR1_MAC_HASH_FLT_HIGH_MASK (0xFFFFFFFFU)
#define NETC_ENETC_PSIMMHFR1_MAC_HASH_FLT_HIGH_SHIFT (0U)
#define NETC_ENETC_PSIMMHFR1_MAC_HASH_FLT_HIGH(x) (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSIMMHFR1_MAC_HASH_FLT_HIGH_SHIFT)) & NETC_ENETC_PSIMMHFR1_MAC_HASH_FLT_HIGH_MASK)
/*! @} */

/* The count of NETC_ENETC_PSIMMHFR1 */
#define NETC_ENETC_PSIMMHFR1_COUNT               (2U)

/*! @name PSIVHFR0 - Port station interface 0 VLAN hash filter register 0..Port station interface 1 VLAN hash filter register 0 */
/*! @{ */

#define NETC_ENETC_PSIVHFR0_VLAN_HASH_FLT_LOW_MASK (0xFFFFFFFFU)
#define NETC_ENETC_PSIVHFR0_VLAN_HASH_FLT_LOW_SHIFT (0U)
#define NETC_ENETC_PSIVHFR0_VLAN_HASH_FLT_LOW(x) (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSIVHFR0_VLAN_HASH_FLT_LOW_SHIFT)) & NETC_ENETC_PSIVHFR0_VLAN_HASH_FLT_LOW_MASK)
/*! @} */

/* The count of NETC_ENETC_PSIVHFR0 */
#define NETC_ENETC_PSIVHFR0_COUNT                (2U)

/*! @name PSIVHFR1 - Port station interface 0 VLAN hash filter register 1..Port station interface 1 VLAN hash filter register 1 */
/*! @{ */

#define NETC_ENETC_PSIVHFR1_VLAN_HASH_FLT_HIGH_MASK (0xFFFFFFFFU)
#define NETC_ENETC_PSIVHFR1_VLAN_HASH_FLT_HIGH_SHIFT (0U)
#define NETC_ENETC_PSIVHFR1_VLAN_HASH_FLT_HIGH(x) (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSIVHFR1_VLAN_HASH_FLT_HIGH_SHIFT)) & NETC_ENETC_PSIVHFR1_VLAN_HASH_FLT_HIGH_MASK)
/*! @} */

/* The count of NETC_ENETC_PSIVHFR1 */
#define NETC_ENETC_PSIVHFR1_COUNT                (2U)


/*!
 * @}
 */ /* end of group NETC_ENETC_Register_Masks */


/*!
 * @}
 */ /* end of group NETC_ENETC_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_NETC_ENETC_H_ */

